#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
random_password.postgres_password: Refreshing state... [id=none]
tls_private_key.wiz_key: Refreshing state... [id=f774171bcfeac0f1fc031e3346635704673d429a]
random_string.bucket_suffix: Refreshing state... [id=twonwfbw]
tls_private_key.wiz_bastion_key: Refreshing state... [id=cfcece1b5215417572703ea2eadbc403dc57865a]
tls_private_key.wiz_postgres_key: Refreshing state... [id=3e9ae03b5091f30114cd8bdcb7d4d37542b96d50]
local_file.wiz_private_key: Refreshing state... [id=84304d034e242631a7f2b41781829564fe3318b1]
local_file.wiz_bastion_private_key: Refreshing state... [id=2dc72abd13352d4a96820868d40afbc286f5ff0a]
data.aws_region.current: Reading...
aws_key_pair.wiz_key_pair: Refreshing state... [id=wiz-eks-key-pair]
aws_kms_key.wiz_eks_kms_key: Refreshing state... [id=ce6f92d7-2d4e-4e76-bac9-041a77bee855]
aws_iam_policy.wiz_demo_app_policy: Refreshing state... [id=arn:aws:iam::571600872795:policy/wiz-demo-app-policy]
aws_iam_role.wiz_bastion_role: Refreshing state... [id=wiz-bastion-eks-role]
aws_key_pair.wiz_postgres_key: Refreshing state... [id=wiz-postgres-key]
aws_ecr_repository.demo_app: Refreshing state... [id=demo-app]
aws_iam_role.wiz_postgres_role: Refreshing state... [id=wiz-postgres-ec2-role]
aws_cloudwatch_log_group.wiz_eks_log_group: Refreshing state... [id=/aws/eks/wiz-eks-cluster/cluster]
aws_s3_bucket.wiz_postgres_backups: Refreshing state... [id=wiz-postgres-backups-twonwfbw]
data.aws_region.current: Read complete after 0s [id=us-west-2]
aws_iam_role.wiz_eks_node_group_role: Refreshing state... [id=wiz-eks-node-group-role]
data.aws_ami.amazon_linux: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_policy.wiz_postgres_custom_policy: Refreshing state... [id=arn:aws:iam::571600872795:policy/wiz-postgres-custom-policy]
aws_iam_policy.wiz_bastion_eks_policy: Refreshing state... [id=arn:aws:iam::571600872795:policy/wiz-bastion-eks-full-access]
data.aws_caller_identity.current: Read complete after 0s [id=571600872795]
aws_vpc.wiz_vpc: Refreshing state... [id=vpc-0c932ffc3f851756c]
aws_iam_role.wiz_eks_cluster_role: Refreshing state... [id=wiz-eks-cluster-role]
data.aws_ami.wiz_bastion_ami: Reading...
data.aws_availability_zones.available: Reading...
aws_key_pair.wiz_bastion_key_pair: Refreshing state... [id=wiz-bastion-key-pair]
aws_iam_role_policy_attachment.wiz_bastion_admin_access: Refreshing state... [id=wiz-bastion-eks-role-20250828204353167500000001]
aws_iam_instance_profile.wiz_bastion_instance_profile: Refreshing state... [id=wiz-bastion-instance-profile]
aws_iam_role_policy_attachment.wiz_bastion_ssm_policy: Refreshing state... [id=wiz-bastion-eks-role-20250822142711360300000005]
aws_iam_role_policy_attachment.wiz_ec2_container_registry_read_only: Refreshing state... [id=wiz-eks-node-group-role-20250821163711446700000004]
aws_iam_role_policy_attachment.wiz_eks_cni_policy: Refreshing state... [id=wiz-eks-node-group-role-20250821163711542800000005]
aws_iam_instance_profile.wiz_eks_node_instance_profile: Refreshing state... [id=wiz-eks-node-instance-profile]
aws_iam_role_policy_attachment.wiz_eks_worker_node_policy: Refreshing state... [id=wiz-eks-node-group-role-20250821163711583200000006]
aws_iam_role_policy_attachment.wiz_eks_ssm_policy: Refreshing state... [id=wiz-eks-node-group-role-20250822142710981300000001]
aws_iam_instance_profile.wiz_postgres_instance_profile: Refreshing state... [id=wiz-postgres-instance-profile]
aws_iam_role_policy_attachment.wiz_postgres_admin_access: Refreshing state... [id=wiz-postgres-ec2-role-20250828204353190200000004]
aws_iam_role_policy_attachment.wiz_postgres_ssm_policy: Refreshing state... [id=wiz-postgres-ec2-role-20250822142711191100000002]
aws_iam_role_policy_attachment.wiz_postgres_cloudwatch_policy: Refreshing state... [id=wiz-postgres-ec2-role-20250822142711296400000003]
aws_iam_role_policy_attachment.wiz_postgres_custom_policy_attachment: Refreshing state... [id=wiz-postgres-ec2-role-20250822142711341900000004]
aws_iam_role_policy_attachment.wiz_bastion_eks_policy_attachment: Refreshing state... [id=wiz-bastion-eks-role-20250822142711438600000006]
aws_iam_role_policy_attachment.wiz_eks_cluster_policy: Refreshing state... [id=wiz-eks-cluster-role-20250821163711654500000007]
aws_iam_role_policy_attachment.wiz_eks_vpc_resource_controller: Refreshing state... [id=wiz-eks-cluster-role-20250821163711720300000008]
aws_ecr_lifecycle_policy.demo_app_lifecycle: Refreshing state... [id=demo-app]
aws_kms_alias.wiz_eks_kms_alias: Refreshing state... [id=alias/wiz-eks-kms-key]
data.aws_availability_zones.available: Read complete after 1s [id=us-west-2]
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0bbc328167dee8f3c]
data.aws_ami.wiz_bastion_ami: Read complete after 1s [id=ami-0bbc328167dee8f3c]
aws_security_group.wiz_bastion_sg: Refreshing state... [id=sg-0ce0cf5626af514c1]
aws_security_group.wiz_eks_cluster_sg: Refreshing state... [id=sg-0b10c5a74145986f7]
aws_internet_gateway.wiz_igw: Refreshing state... [id=igw-0e91c0c064bab7ff1]
aws_subnet.wiz_private_subnets[1]: Refreshing state... [id=subnet-0f58fa7e3d64db31d]
aws_subnet.wiz_public_subnets[0]: Refreshing state... [id=subnet-00f8427a6b27cdb42]
aws_subnet.wiz_public_subnets[1]: Refreshing state... [id=subnet-004867c065ce5b77b]
aws_subnet.wiz_private_subnets[0]: Refreshing state... [id=subnet-0f18eb530a32b747c]
aws_eip.wiz_nat_eip: Refreshing state... [id=eipalloc-0e7e5b106a247da79]
aws_route_table.wiz_public_rt: Refreshing state... [id=rtb-02ec1f0237b904ddc]
aws_security_group.wiz_eks_nodes_sg: Refreshing state... [id=sg-0c8b0b81a0683488a]
aws_s3_bucket_versioning.wiz_postgres_backups_versioning: Refreshing state... [id=wiz-postgres-backups-twonwfbw]
aws_s3_bucket_server_side_encryption_configuration.wiz_postgres_backups_encryption: Refreshing state... [id=wiz-postgres-backups-twonwfbw]
aws_s3_bucket_public_access_block.wiz_postgres_backups_pab: Refreshing state... [id=wiz-postgres-backups-twonwfbw]
aws_route_table_association.wiz_public_rta[0]: Refreshing state... [id=rtbassoc-0ccdff433aabb86ce]
aws_route_table_association.wiz_public_rta[1]: Refreshing state... [id=rtbassoc-0f333e4216c8bfc04]
aws_eks_cluster.wiz_cluster: Refreshing state... [id=wiz-eks-cluster]
aws_instance.wiz_bastion: Refreshing state... [id=i-0965057dc204656d5]
aws_security_group_rule.wiz_cluster_ingress_node_https: Refreshing state... [id=sgrule-1437069111]
aws_security_group_rule.wiz_allow_bastion_to_nodes: Refreshing state... [id=sgrule-1147916955]
aws_security_group.wiz_postgres_sg: Refreshing state... [id=sg-0aad980e14fbf20c0]
aws_s3_bucket_policy.wiz_postgres_backups_policy: Refreshing state... [id=wiz-postgres-backups-twonwfbw]
aws_nat_gateway.wiz_nat_gateway: Refreshing state... [id=nat-0dcf975f026dbcd5b]
aws_instance.wiz_postgres: Refreshing state... [id=i-024808a02fe2070c3]
aws_route_table.wiz_private_rt: Refreshing state... [id=rtb-03b095a4607b2cf7c]
data.aws_eks_cluster_auth.cluster: Reading...
data.aws_eks_cluster.cluster: Reading...
aws_eks_node_group.wiz_node_group: Refreshing state... [id=wiz-eks-cluster:wiz-node-group]
data.aws_eks_cluster_auth.cluster: Read complete after 0s [id=wiz-eks-cluster]
aws_route_table_association.wiz_private_rta[0]: Refreshing state... [id=rtbassoc-0a74951671a87fe30]
aws_route_table_association.wiz_private_rta[1]: Refreshing state... [id=rtbassoc-04d9dde1376199a0a]
data.aws_eks_cluster.cluster: Read complete after 0s [id=wiz-eks-cluster]
data.tls_certificate.cluster: Reading...
aws_eks_addon.vpc_cni: Refreshing state... [id=wiz-eks-cluster:vpc-cni]
aws_eks_addon.kube_proxy: Refreshing state... [id=wiz-eks-cluster:kube-proxy]
kubernetes_namespace.argocd: Refreshing state... [id=argocd]
kubernetes_config_map_v1_data.aws_auth: Refreshing state... [id=kube-system/aws-auth]
aws_eks_addon.coredns: Refreshing state... [id=wiz-eks-cluster:coredns]
kubernetes_namespace.secrets: Refreshing state... [id=secrets]
data.tls_certificate.cluster: Read complete after 0s [id=213644035344c59e44dd4b37f3e17ae888eed9e0]
aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::571600872795:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/55E645B6C27133F1C809124BB58F1FBF]
aws_iam_role.service_account_role: Refreshing state... [id=wiz-eks-service-account-role]
aws_iam_role.wiz_ebs_csi_driver_role: Refreshing state... [id=wiz-ebs-csi-driver-role]
aws_iam_role.wiz_demo_app_role: Refreshing state... [id=wiz-demo-app-role]
aws_ecr_repository_policy.demo_app_policy: Refreshing state... [id=demo-app]
aws_iam_role_policy_attachment.wiz_demo_app_admin_access: Refreshing state... [id=wiz-demo-app-role-20250828204353178500000002]
aws_iam_role_policy_attachment.wiz_demo_app_policy_attachment: Refreshing state... [id=wiz-demo-app-role-20250825190220767900000001]
aws_iam_role_policy_attachment.wiz_ebs_csi_driver_policy: Refreshing state... [id=wiz-ebs-csi-driver-role-20250825015605698900000001]
helm_release.argocd: Refreshing state... [id=argocd]
aws_iam_role_policy_attachment.service_account_policy: Refreshing state... [id=wiz-eks-service-account-role-20250822143615153200000011]
kubernetes_service_account.wiz_service_account: Refreshing state... [id=default/wiz-service-account]
aws_iam_role_policy_attachment.service_account_admin_access: Refreshing state... [id=wiz-eks-service-account-role-20250828204353178500000003]
aws_eks_addon.ebs_csi_driver: Refreshing state... [id=wiz-eks-cluster:aws-ebs-csi-driver]
kubernetes_secret.postgres_secret: Refreshing state... [id=secrets/postgres-secret]
null_resource.argo_application: Refreshing state... [id=965455329477944135]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_instance.wiz_postgres will be updated in-place
  ~ resource "aws_instance" "wiz_postgres" {
        id                                   = "i-024808a02fe2070c3"
      ~ public_dns                           = "ec2-34-214-111-221.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "34.214.111.221" -> (known after apply)
        tags                                 = {
            "Name"    = "wiz-postgres-instance"
            "Type"    = "database"
            "purpose" = "wiz"
        }
      ~ user_data                            = (sensitive value)
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_security_group_rule.wiz_allow_bastion_to_nodes will be created
  + resource "aws_security_group_rule" "wiz_allow_bastion_to_nodes" {
      + description              = "Allow SSH from bastion to EKS nodes"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0c8b0b81a0683488a"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0ce0cf5626af514c1"
      + to_port                  = 22
      + type                     = "ingress"
    }

  # aws_security_group_rule.wiz_cluster_ingress_node_https will be created
  + resource "aws_security_group_rule" "wiz_cluster_ingress_node_https" {
      + description              = "Allow nodes to communicate with cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0b10c5a74145986f7"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0c8b0b81a0683488a"
      + to_port                  = 443
      + type                     = "ingress"
    }

  # local_file.wiz_bastion_private_key will be created
  + resource "local_file" "wiz_bastion_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./wiz-bastion-key.pem"
      + id                   = (known after apply)
    }

  # local_file.wiz_private_key will be created
  + resource "local_file" "wiz_private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0400"
      + filename             = "./wiz-eks-key.pem"
      + id                   = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ postgres_public_ip                 = "34.214.111.221" -> (known after apply)
  ~ postgres_ssh_command               = "ssh -i wiz-bastion-key.pem ubuntu@34.214.111.221" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @jeffellin, Action: `pull_request`*